app/Controllers/Personas.php

DELETE FROM `personas`
WHERE `id` IN ('4')
---
    public function borrarPersona($id) {
        $personaModel = new Persona();
        $personaModel->delete($id);

SELECT *
FROM `personas`
---
    public function index(){
        $personaModel = new Persona();
        $data['personas'] = $personaModel->findAll();