app/Models/Persona.php

    public function actualizarPersona($id, $datos) {
        // Asegúrate de que los campos en $datos coincidan con los campos permitidos en $allowedFields
        $datosValidos = array_intersect_key($datos, array_flip($this->allowedFields));
        if (!empty($datosValidos)) {
            $this->update($id, $datosValidos);
---
UPDATE `personas` SET `nombre` = 'henry', `apellido` = 'cedeño', `telefono` = '0998763244', `edad` = '26', `email` = 'Hced1234@outlook.com'
WHERE `personas`.`id` IN ('')