app/Models/Usuario.php

SELECT *
FROM `usuario`
WHERE `usuario` = 'geremy'
AND `estado` = 'A'
---
    public function buscarUsuarioPorUsuario($usuario)
    {
        $db=db_connect();
        $builder=$db->table($this->table)->where('usuario',$usuario)->where('estado','A');
        $resultado=$builder->get();